Занятие_13/src/Documents/ОказаниеУслуги/ОказаниеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОказаниеУслуги</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьМатериалов</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Занятие_13/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Выручка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:AccumulationRegister>

Занятие_13/src/Documents/ОказаниеУслуги/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора внесенные вручную изменения будут утеряны!!!

	Движения.ОстаткиМатериалов.Записывать = Истина;
	Движения.СтоимостьМатериалов.Записывать = Истина;
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаПереченьНоменклатуры Из ПереченьНоменклатуры Цикл
		// Движения по регистру Продажи (для всех строк)
		ДвижениеПродажи = Движения.Продажи.Добавить();
		ДвижениеПродажи.Период = Дата;
		ДвижениеПродажи.Номенклатура = ТекСтрокаПереченьНоменклатуры.Номенклатура;
		ДвижениеПродажи.Клиент = Клиент;
		ДвижениеПродажи.Мастер = Мастер;
		ДвижениеПродажи.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
		ДвижениеПродажи.Выручка = ТекСтрокаПереченьНоменклатуры.Сумма;
		ДвижениеПродажи.Стоимость = 0;
		// Движения по складским регистрам (только для материалов)
		Если ТекСтрокаПереченьНоменклатуры.Номенклатура.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Материал Тогда
			Движение = Движения.ОстаткиМатериалов.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Материал = ТекСтрокаПереченьНоменклатуры.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
			// Стоимость материалов
			ДвижениеСтоимость = Движения.СтоимостьМатериалов.Добавить();
			ДвижениеСтоимость.Период = Дата;
			ДвижениеСтоимость.Номенклатура = ТекСтрокаПереченьНоменклатуры.Номенклатура;
			ДвижениеСтоимость.Количество = ТекСтрокаПереченьНоменклатуры.Количество;
			ДвижениеСтоимость.Стоимость = ТекСтрокаПереченьНоменклатуры.Сумма;
			// Записываем стоимость в движение продаж
			ДвижениеПродажи.Стоимость = ТекСтрокаПереченьНоменклатуры.Сумма;
		КонецЕсли;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

КонецПроцедуры
